lib/stripe_model_callbacks/fixtures/stripe_events/charge/charge.refund.updated.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "charge.refund.updated",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2020-03-02",
  "data": {
    "object": {
      "id": "re_00000000000000",
      "object": "refund",
      "amount": 100,
      "balance_transaction": null,
      "charge": "ch_00000000000000",
      "created": 1584470629,
      "currency": "usd",
      "metadata": {
      },
      "payment_intent": null,
      "reason": null,
      "receipt_number": null,
      "source_transfer_reversal": null,
      "status": "succeeded",
      "transfer_reversal": null
    },
    "previous_attributes": {
      "metadata": {
        "order_id": "old_order_id"
      }
    }
  }
}